x = float(input("กรุณาใส่ระยะทางของคุณ(หน่วยเป็นกิโลเมตร)"))
price = 0
if x < 5:
    print(" ระยะทางเท่ากับ",x,"กม.")
    print("ส่งฟรี")
elif x >= 5 and x <= 50:
    price = 10 + (7/100*10)
    print(" ระยะทางเท่ากับ",x,"กม.")
    print(" ราคา 10 บาท")
    print(" vat 7% เท่ากับ ",7/100*10)
    print(" ราคาสุทธิเท่า ",price,"บาท")
elif x >= 51 and x <= 100:
    price = 15 + (7/100*15)
    print(" ระยะทางเท่ากับ",x,"กม.")
    print(" ราคา 15 บาท")
    print(" vat 7% เท่ากับ ",7/100*15)
    print(" ราคาสุทธิเท่ากับ ",price,"บาท")
elif x >= 101 and x <= 300:
    price = 25 + (7/100*25)
    print(" ระยะทางเท่ากับ",x,"กม.")
    print(" ราคา 25 บาท")
    print(" vat 7% เท่ากับ ",7/100*25)
    print(" ราคาสุทธิเท่ากับ",price,"บาท")
elif x >= 301 and x <= 500:
    price = 35 + (7/100*30)
    print(" ระยะทางเท่ากับ",x,"กม.")
    print(" ราคา 35 บาท")
    print(" vat 7% เท่ากับ ",7/100*35)
    print(" ราคาสุทธิเท่ากับ",price,"บาท")
elif x > 500:
    price = 45 + (7/100*45)
    print(" ระยะทางเท่ากับ",x,"กม.")
    print(" ราคา 45 บาท")
    print(" vat 7% เท่ากับ ",7/100*45)
    print(" ราคาสุทธิเท่ากับ",price,"บาท")
